Revit 2027 API
BuiltInFailures.ToposolidBooleanPerturbationFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ToposolidBooleanPerturbationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ToposolidBooleanPerturbationFailures
Public NotInheritable Class ToposolidBooleanPerturbationFailures
public ref class ToposolidBooleanPerturbationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ToposolidBooleanPerturbationFailures = class end
The BuiltInFailures.ToposolidBooleanPerturbationFailures type exposes the following members.
Properties
Name | Description
NonPerturbationBooleanFailed |  Boolean operation failed without perturbation.
Top
See Also
Reference
Autodesk.Revit.DB Namespace